Tdebug(self,"log","zhCN.lua加载开始");
--  判断本地语言是否为指定值,否则直接退出,不再进行之后动作.
if(GetLocale() ~= "zhCN") then return end

--[[-------------------------------------------------------------------------
--  本地化表
-------------------------------------------------------------------------]]--
local Locale = {
    ["Hello Azeroth!"] = "你好艾泽拉斯!",
    ["Tinom插件设置"] = "Tinom插件设置",
    ["在这里你可以控制插件主要功能的 开启/关闭 ."] = "在这里你可以控制插件主要功能的 开启/关闭 .",
    ["开启插件"] = "开启插件",
}

--[[-------------------------------------------------------------------------
--  本地化函数
-------------------------------------------------------------------------]]--
Tinom.L = setmetatable(Locale, {
    __index = function(_, key)
        --Tdebug(self,"log",key)
        return key;
    end
})

--释放内存
Locale = nil;

Tdebug(self,"log","zhCN.lua加载完成");